---
type: RevitAPIPreEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 1
tags: [revit-api, class]
---

# RevitAPIPreEventArgs

`Autodesk.Revit.DB.Events.RevitAPIPreEventArgs` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Cancel | 2011 | `public void Cancel ()` |